<?php

namespace Aloha\Config;

class VietnameseCharacterUnicode
{

    /**
     * Bảng mã Unicode
     *
     * @return void
     */
    public static function getUnicode()
    {
        return [
            "\x{00C0}", //À
            "\x{00C1}", //Á
            "\x{00C2}", //Â
            "\x{00C3}", //Ã
            "\x{00C8}", //È
            "\x{00C9}", //É
            "\x{00CA}", //Ê
            "\x{00CC}", //Ì
            "\x{00CD}", //Í
            "\x{00D2}", //Ò
            "\x{00D3}", //Ó
            "\x{00D4}", //Ô
            "\x{00D5}", //Õ
            "\x{00D9}", //Ù
            "\x{00DA}", //Ú
            "\x{00DD}", //Ý
            "\x{00E0}", //à
            "\x{00E1}", //á
            "\x{00E2}", //â
            "\x{00E3}", //ã
            "\x{00E8}", //è
            "\x{00E9}", //é
            "\x{00EA}", //ê
            "\x{00EC}", //ì
            "\x{00ED}", //í
            "\x{00F2}", //ò
            "\x{00F3}", //ó
            "\x{00F4}", //ô
            "\x{00F5}", //õ
            "\x{00F9}", //ù
            "\x{00FA}", //ú
            "\x{00FD}", //ý
            "\x{0102}", //Ă
            "\x{0103}", //ă
            "\x{0110}", //Đ
            "\x{0111}", //đ
            "\x{0128}", //Ĩ
            "\x{0129}", //ĩ
            "\x{0168}", //Ũ
            "\x{0169}", //ũ
            "\x{01A0}", //Ơ
            "\x{01A1}", //ơ
            "\x{01AF}", //Ư
            "\x{01B0}", //ư
            "\x{1EA0}", //Ạ
            "\x{1EA1}", //ạ
            "\x{1EA2}", //Ả
            "\x{1EA3}", //ả
            "\x{1EA4}", //Ấ
            "\x{1EA5}", //ấ
            "\x{1EA6}", //Ầ
            "\x{1EA7}", //ầ
            "\x{1EA8}", //Ẩ
            "\x{1EA9}", //ẩ
            "\x{1EAA}", //Ẫ
            "\x{1EAB}", //ẫ
            "\x{1EAC}", //Ậ
            "\x{1EAD}", //ậ
            "\x{1EAE}", //Ắ
            "\x{1EAF}", //ắ
            "\x{1EB0}", //Ằ
            "\x{1EB1}", //ằ
            "\x{1EB2}", //Ẳ
            "\x{1EB3}", //ẳ
            "\x{1EB4}", //Ẵ
            "\x{1EB5}", //ẵ
            "\x{1EB6}", //Ặ
            "\x{1EB7}", //ặ
            "\x{1EB8}", //Ẹ
            "\x{1EB9}", //ẹ
            "\x{1EBA}", //Ẻ
            "\x{1EBB}", //ẻ
            "\x{1EBC}", //Ẽ
            "\x{1EBD}", //ẽ
            "\x{1EBE}", //Ế
            "\x{1EBF}", //ế
            "\x{1EC0}", //Ề
            "\x{1EC1}", //ề
            "\x{1EC2}", //Ể
            "\x{1EC3}", //ể
            "\x{1EC4}", //Ễ
            "\x{1EC5}", //ễ
            "\x{1EC6}", //Ệ
            "\x{1EC7}", //ệ
            "\x{1EC8}", //Ỉ
            "\x{1EC9}", //ỉ
            "\x{1ECA}", //Ị
            "\x{1ECB}", //ị
            "\x{1ECC}", //Ọ
            "\x{1ECD}", //ọ
            "\x{1ECE}", //Ỏ
            "\x{1ECF}", //ỏ
            "\x{1ED0}", //Ố
            "\x{1ED1}", //ố
            "\x{1ED2}", //Ồ
            "\x{1ED3}", //ồ
            "\x{1ED4}", //Ổ
            "\x{1ED5}", //ổ
            "\x{1ED6}", //Ỗ
            "\x{1ED7}", //ỗ
            "\x{1ED8}", //Ộ
            "\x{1ED9}", //ộ
            "\x{1EDA}", //Ớ
            "\x{1EDB}", //ớ
            "\x{1EDC}", //Ờ
            "\x{1EDD}", //ờ
            "\x{1EDE}", //Ở
            "\x{1EDF}", //ở
            "\x{1EE0}", //Ỡ
            "\x{1EE1}", //ỡ
            "\x{1EE2}", //Ợ
            "\x{1EE3}", //ợ
            "\x{1EE4}", //Ụ
            "\x{1EE5}", //ụ
            "\x{1EE6}", //Ủ
            "\x{1EE7}", //ủ
            "\x{1EE8}", //Ứ
            "\x{1EE9}", //ứ
            "\x{1EEA}", //Ừ
            "\x{1EEB}", //ừ
            "\x{1EEC}", //Ử
            "\x{1EED}", //ử
            "\x{1EEE}", //Ữ
            "\x{1EEF}", //ữ
            "\x{1EF0}", //Ự
            "\x{1EF1}", //ự
            "\x{1EF2}", //Ỳ
            "\x{1EF3}", //ỳ
            "\x{1EF4}", //Ỵ
            "\x{1EF5}", //ỵ
            "\x{1EF6}", //Ỷ
            "\x{1EF7}", //ỷ
            "\x{1EF8}", //Ỹ
            "\x{1EF9}", //ỹ
        ];
    }

}
